{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 64, 64], "dtype": "float32", "filters": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "trainable": true, "data_format": "channels_first", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 64, 64], "dtype": "float32", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "trainable": true, "data_format": "channels_first", "activation": "tanh", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 64, 64], "dtype": "float32", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [8, 8], "name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "trainable": true, "data_format": "channels_first", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "units": 128, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "units": 1024, "name": "dense_2", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "units": 9, "name": "dense_3", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}}]}}